PGM

/* Create your USRPRF before executing this.  +
    The user can be anything but only _ special characters +
    the HOMEDIR can be where you like but don't create it e.g. /existing_dirs/usrprf */
/* CRTUSRPRF USRPRF(USRPRF) PASSWORD(password) +
    CURLIB(RITFORI) SPCAUT(*ALLOBJ *SECADM *AUDIT) HOMEDIR('/home/usrprf') */
/* This will be executed signed in as USRPRF created for RITFORI +
    set up  SSH and bash plus the home directory and libray RITFORI */  

/* Constant variables */
DCL VAR(&UTF) TYPE(*CHAR) LEN(25) VALUE('export LANG=en_US.UTF-8; ')

/* Other Variables */       
DCL VAR(&LOG) TYPE(*CHAR) LEN(1024)
DCL var(&LOGPIPE) TYPE(*CHAR) LEN(1024)
DCL VAR(&STRING) TYPE(*CHAR) LEN(1024)
DCL VAR(&TOPDIR) TYPE(*CHAR) LEN(1024)
DCL VAR(&USRPRF) TYPE(*CHAR) LEN(10)

/* Setup User Profile */
CRTLIB LIB(RITFORI) TEXT('RITFORI Let''s Encrypt Acme Programs') +
   AUT(*EXCLUDE) CRTAUT(*EXCLUDE) CRTOBJAUD(*NONE) 
CHGCURLIB CURLIB(RITFORI)

RTVUSRPRF  RTNUSRPRF(&USRPRF) 
CRTDTAARA DTAARA(USRHOME) TYPE(*CHAR) LEN(1024) VALUE('     ')
MONMSG MSGID(CPF1023)
CHGVAR VAR(&STRING) VALUE('/tmp/ritfori/code/Store_home.sh')
STRQSH CMD(&STRING)
RTVDTAARA  DTAARA(USRHOME *ALL) RTNVAR(&TOPDIR)

MKDIR DIR(&TOPDIR) DTAAUT(*EXCLUDE) OBJAUT(*NONE) 
CHGATR OBJ(&TOPDIR) ATR(*CCSID) VALUE(1208)
CD DIR(&TOPDIR)
MKDIR DIR('acme')
CHGATR OBJ('acme') ATR(*CCSID) VALUE(1208)
MKDIR DIR('acme/log')
CHGATR OBJ('acme/log') ATR(*CCSID) VALUE(1208) 

/* Top directory is now directory of user */
CHGVAR VAR(&LOG) VALUE(&TOPDIR *TCAT '/acme/log/setupUser.log ')
CHGVAR VAR(&LOGPIPE) VALUE(' >> ' *CAT &LOG *TCAT ' 2>&1 ')

/* Setup SSH and .profile */
CHGVAR VAR(&STRING) VALUE(&UTF *CAT  '/tmp/ritfori/code/SSH_Profile.sh ' *CAT &LOGPIPE)
STRQSH CMD(&STRING)

/* Set BASH as the default shell for this user */
CHGVAR VAR(&STRING) VALUE('CALL QSYS2.SET_PASE_SHELL_INFO(''' *CAT &USRPRF *TCAT ''',''/QOpenSys/pkgs/bin/bash'')')
RUNSQL SQL(&STRING)
CHGFCNUSG FCNID(QIBM_DB_SECADM) USER(&USRPRF) USAGE(*ALLOWED)

/* Change CCSID, Owner and Authority */
CHGOWN OBJ('/tmp/ritfori') NEWOWN(&USRPRF) SUBTREE(*ALL)
CHGATR OBJ('/tmp/ritfori') ATR(*CCSID) VALUE(1208) SUBTREE(*ALL)
CHGAUT OBJ('/tmp/ritfori') USER(QDIRSRV QTMHHTTP) DTAAUT(*NONE) OBJAUT(*NONE) SUBTREE(*ALL)
CHGAUT OBJ('/tmp/ritfori') USER(*PUBLIC) DTAAUT(*EXCLUDE) OBJAUT(*NONE) SUBTREE(*ALL)

/* Create directory levels for Acme account data, code, and certificates */
CHGVAR VAR(&STRING) VALUE('''' *CAT &TOPDIR *TCAT '/.acme.sh''')
MKDIR DIR(&STRING)
CHGATR OBJ(&STRING) ATR(*CCSID) VALUE(1208)
CHGVAR VAR(&STRING) VALUE('''' *CAT &TOPDIR *TCAT '/acme/acct''')
MKDIR DIR(&STRING)
CHGATR OBJ(&STRING) ATR(*CCSID) VALUE(1208)
CHGVAR VAR(&STRING) VALUE('''' *CAT &TOPDIR *TCAT '/acme/data''')
MKDIR DIR(&STRING)
CHGATR OBJ(&STRING) ATR(*CCSID) VALUE(1208)
CHGVAR VAR(&STRING) VALUE('''' *CAT &TOPDIR *TCAT '/acme/data/certs''')
MKDIR DIR(&STRING)
CHGATR OBJ(&STRING) ATR(*CCSID) VALUE(1208)
CHGVAR VAR(&STRING) VALUE('''' *CAT &TOPDIR *TCAT '/acme/source''')
MKDIR DIR(&STRING)
CHGATR OBJ(&STRING) ATR(*CCSID) VALUE(1208)

CRTBNDCL PGM(RITFORI/AcmePgms) SRCSTMF('/tmp/ritfori/code/AcmePgms.clle') +
            DFTACTGRP(*NO) ACTGRP(*NEW)
CALL PGM(RITFORI/ACMEPGMS)

ENDPGM